УТ_для_edt.РасширениеСмарт/src/Catalogs/СегментыПартнеров/СегментыПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СегментыПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>смарт_ВычислятьПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смарт_ВычисляемыйКодПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыФормированияСегментов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФормироватьВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/СегментыПартнеров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ смарт:Демичев №921 22.03.2022     
	НоваяГруппа = Элементы.Вставить("смартГруппаУсловия", Тип("ГруппаФормы"),, Элементы.ГруппаШапкаНиз);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	НовыйЭлемент = Элементы.Добавить("смартВычислятьПериод", Тип("ПолеФормы"),Элементы.смартГруппаУсловия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смарт_ВычислятьПериод";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзменненииФлагВычислитьПериод");
		
	НовыйЭлемент = Элементы.Вставить("смарт_ВычисляемыйКодПериод", Тип("ПолеФормы"), Элементы.смартГруппаУсловия);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смарт_ВычисляемыйКодПериод";  
	НовыйЭлемент.Заголовок = "Вычисляемый период(мДатаНачала/мДатаКонец)";
	НовыйЭлемент.Ширина = 30;
	НовыйЭлемент.Высота = 10;
	
	мСпрСегментВип = Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение;
	Если мСпрСегментВип = Объект.Ссылка Тогда
		
		НоваяКоманда = Команды.Добавить("смартВывестиВОтчетСегмент");
		НоваяКоманда.Действие = "смартВывестиВОтчетСегмент";
		НоваяКоманда.Заголовок = "Вывод в отчет (VIP)";
				
		НовыйЭлемент = Элементы.Добавить("ЭлементВыводВипСегмента", Тип("КнопкаФормы"),ЭтаФорма.КоманднаяПанель);
		НовыйЭлемент.ИмяКоманды = "смартВывестиВОтчетСегмент";
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;

		
	КонецЕсли;
	
		
	Если Объект.СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять Тогда
		
		   ОбновитьЭлементыНаФормеСмарт();
		
	КонецЕсли;		
	//-- смарт:Демичев №921 22.03.2022
	  
КонецПроцедуры

&НаСервере
Процедура ВывестиСоставСегмментаВИП(ТабДокумент)
	
	мДатаНачала = ТекущаяДата();
	мДатаКонец = КонецДня(мДатаНачала);
	
	ПВХИД = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул","ВИПКлиент");
	
	РеквизитыСКДСегмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	Объект.Ссылка,
	"СхемаКомпоновкиДанных,ХранилищеНастроекКомпоновкиДанных,ИмяШаблонаСКД");
	
	НастройкиСегмента = РеквизитыСКДСегмента.ХранилищеНастроекКомпоновкиДанных.Получить();	
	
	Если Объект.смарт_ВычислятьПериод и Не ПустаяСтрока(Объект.смарт_ВычисляемыйКодПериод) Тогда
		
		мТекПараметрыДат = НастройкиСегмента.ПараметрыДанных.Элементы.Найти("Период");	
		Если мТекПараметрыДат <> Неопределено Тогда
			
			
			Выполнить(Объект.смарт_ВычисляемыйКодПериод); 
			
		Иначе
			
			мТекПараметрыДатНачало = НастройкиСегмента.ПараметрыДанных.Элементы.Найти("НачалоПериода");	
			мТекПараметрыДатКонец = НастройкиСегмента.ПараметрыДанных.Элементы.Найти("ОкончаниеПериода");	
			
			Если мТекПараметрыДат <> Неопределено и мТекПараметрыДатКонец <> Неопределено Тогда
				
				мДатаНачала = мТекПараметрыДатНачало.Значение;
				мДатаКонец  = мТекПараметрыДатКонец.Значение;
				
			КонецЕсли; 
			
		КонецЕсли;
	КонецЕсли; 
	
	мСпрНоменклатура = Справочники.Номенклатура.ПустаяСсылка();	
	ПолеНоменклатура = Новый ПолеКомпоновкиДанных("Номенклатура");
	
	Для Каждого Элемент Из НастройкиСегмента.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеНоменклатура Тогда
			
			мСпрНоменклатура = Элемент.ПравоеЗначение;
			
		КонецЕсли;
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ДопСведение
		|{ВЫБРАТЬ
		|	Объект.*,
		|	Свойство.*,
		|	Значение.*}
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &СвойствоВип
		|	И ДополнительныеСведения.Значение = ИСТИНА
		|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартнерыСегмента.Партнер КАК Партнер
		|ПОМЕСТИТЬ СоставСегмента
		|{ВЫБРАТЬ
		|	Партнер.*}
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	НЕ ПартнерыСегмента.Партнер В
		|				(ВЫБРАТЬ
		|					ВТ_ДопСведение.Объект КАК Объект
		|				ИЗ
		|					ВТ_ДопСведение КАК ВТ_ДопСведение)
		|	И ПартнерыСегмента.Сегмент = &Сегмент
		|{ГДЕ
		|	ПартнерыСегмента.Сегмент}
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыСегмента.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Выручка КАК Выручка,
		|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
		|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
		|	ВложенныйЗапрос.ДопРасходы КАК ДопРасходы,
		|	ВложенныйЗапрос.Партнер КАК Партнер
		|ПОМЕСТИТЬ ВТ_ТЗПоОтбору
		|{ВЫБРАТЬ
		|	Выручка КАК ВыручкаОборот,
		|	Себестоимость КАК СебестоимостьОборот,
		|	ВаловаяПрибыль КАК ВаловаяПрибыльОборот,
		|	ДопРасходы КАК ДопРасходыОборот,
		|	Партнер.* КАК ПартнерСегмента}
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВыручкаИСебестоимость.СуммаВыручкиОборот) КАК Выручка,
		|		СУММА(ВыручкаИСебестоимость.СтоимостьОборот) КАК Себестоимость,
		|		СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимость.СуммаВыручкиОборот - ВыручкаИСебестоимость.ДопРасходыОборот - ВыручкаИСебестоимость.СтоимостьОборот КАК ЧИСЛО(15, 2))) КАК ВаловаяПрибыль,
		|		СУММА(ВыручкаИСебестоимость.ДопРасходыОборот) КАК ДопРасходы,
		|		СоставСегмента.Партнер КАК Партнер
		|	{ВЫБРАТЬ
		|		Выручка,
		|		Себестоимость,
		|		ВаловаяПрибыль,
		|		ДопРасходы,
		|		Партнер.*}
		|	ИЗ
		|		СоставСегмента КАК СоставСегмента
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&ОкончаниеПериода)}, Период, АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&СписокНоменклатуры) {(АналитикаУчетаПоПартнерам.Контрагент).* КАК Контрагент, (АналитикаУчетаПоПартнерам.Организация).* КАК Организация, (АналитикаУчетаНоменклатуры.Номенклатура).* КАК Номенклатура}) КАК ВыручкаИСебестоимость
		|			ПО СоставСегмента.Партнер = ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам.Партнер
		|	{ГДЕ
		|		ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура}
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СоставСегмента.Партнер) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыСегмента.Партнер КАК Партнер
		|ПОМЕСТИТЬ ВТ_СегментСДопСведением
		|{ВЫБРАТЬ
		|	Партнер.*}
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Партнер В
		|			(ВЫБРАТЬ
		|				ВТ_ДопСведение.Объект КАК Объект
		|			ИЗ
		|				ВТ_ДопСведение КАК ВТ_ДопСведение)
		|	И ПартнерыСегмента.Сегмент = &Сегмент
		|{ГДЕ
		|	ПартнерыСегмента.Сегмент.*}
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыСегмента.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
		|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
		|	ВложенныйЗапрос.ДопРасходы КАК ДопРасходы,
		|	ВложенныйЗапрос.Партнер КАК Партнер,
		|	ВложенныйЗапрос.Выручка КАК Выручка
		|ПОМЕСТИТЬ ВТ_ТЗПоОтборуСДоп
		|{ВЫБРАТЬ
		|	Себестоимость КАК СебестоимостьОборот,
		|	ВаловаяПрибыль КАК ВаловаяПрибыльОборот,
		|	ДопРасходы КАК ДопРасходыОборот,
		|	Партнер.* КАК ПартнерСегмента}
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ЕСТЬNULL(ВыручкаИСебестоимость.СуммаВыручкиОборот, 0)) КАК Выручка,
		|		СУММА(ЕСТЬNULL(ВыручкаИСебестоимость.СтоимостьОборот, 0)) КАК Себестоимость,
		|		СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВыручкаИСебестоимость.СуммаВыручкиОборот - ВыручкаИСебестоимость.ДопРасходыОборот - ВыручкаИСебестоимость.СтоимостьОборот КАК ЧИСЛО(15, 2)), 0)) КАК ВаловаяПрибыль,
		|		СУММА(ЕСТЬNULL(ВыручкаИСебестоимость.ДопРасходыОборот, 0)) КАК ДопРасходы,
		|		ВТ_СегментСДопСведением.Партнер КАК Партнер
		|	{ВЫБРАТЬ
		|		Себестоимость,
		|		ВаловаяПрибыль,
		|		ДопРасходы,
		|		Партнер.*,
		|		Выручка}
		|	ИЗ
		|		ВТ_СегментСДопСведением КАК ВТ_СегментСДопСведением
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&ОкончаниеПериода)}, Период, АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&СписокНоменклатуры)) КАК ВыручкаИСебестоимость
		|			ПО ВТ_СегментСДопСведением.Партнер = ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам.Партнер
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_СегментСДопСведением.Партнер) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Партнер КАК Партнер,
		|	ВложенныйЗапрос.Выручка КАК Выручка,
		|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
		|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
		|	ВложенныйЗапрос.ДопРасходы КАК ДопРасходы
		|{ВЫБРАТЬ
		|	Себестоимость,
		|	ВаловаяПрибыль,
		|	ДопРасходы,
		|	Партнер.* КАК ПартнерСегмента}
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ТЗПоОтбору.Выручка КАК Выручка,
		|		ВТ_ТЗПоОтбору.Себестоимость КАК Себестоимость,
		|		ВТ_ТЗПоОтбору.ВаловаяПрибыль КАК ВаловаяПрибыль,
		|		ВТ_ТЗПоОтбору.ДопРасходы КАК ДопРасходы,
		|		ВТ_ТЗПоОтбору.Партнер КАК Партнер
		|	{ВЫБРАТЬ
		|		Выручка,
		|		Себестоимость,
		|		ВаловаяПрибыль,
		|		ДопРасходы,
		|		Партнер.*}
		|	ИЗ
		|		ВТ_ТЗПоОтбору КАК ВТ_ТЗПоОтбору
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ТЗПоОтборуСДоп.Выручка,
		|		ВТ_ТЗПоОтборуСДоп.Себестоимость,
		|		ВТ_ТЗПоОтборуСДоп.ВаловаяПрибыль,
		|		ВТ_ТЗПоОтборуСДоп.ДопРасходы,
		|		ВТ_ТЗПоОтборуСДоп.Партнер
		|	ИЗ
		|		ВТ_ТЗПоОтборуСДоп КАК ВТ_ТЗПоОтборуСДоп) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выручка УБЫВ";

	
	Запрос.УстановитьПараметр("КонецПериода", мДатаКонец);
	Запрос.УстановитьПараметр("НачалоПериода", мДатаНачала);
	Запрос.УстановитьПараметр("СвойствоВип", ПВХИД);
	Запрос.УстановитьПараметр("Сегмент", Объект.Ссылка);
    Запрос.УстановитьПараметр("СписокНоменклатуры", мСпрНоменклатура);

	РезЗапроса = Запрос.Выполнить().Выгрузить();
		
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(РезЗапроса);       
	Построитель.Вывести(ТабДокумент);    
	
КонецПроцедуры	

&НаКлиенте
Процедура смартВывестиВОтчетСегмент(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТабДокумент = Новый ТабличныйДокумент;

		ВывестиСоставСегмментаВИП(ТабДокумент); 
		
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.Показать("VIP Сегмент");   
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыНаФормеСмарт()
	
	//++ смарт:Демичев №921 22.03.2022     
	Элементы.смарт_ВычисляемыйКодПериод.Доступность = Объект.смарт_ВычислятьПериод;
    //-- смарт:Демичев №921 22.03.2022

	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзменненииФлагВычислитьПериод(Элемент)
	
	ОбновитьЭлементыНаФормеСмарт();

	
КонецПроцедуры	

&НаКлиенте
&После("УправлениеДоступностью")
Процедура смарт_УправлениеДоступностью()
	
	  //++ смарт:Демичев №921 22.03.2022    
	  ОбновитьЭлементыНаФормеСмарт();
	  //-- смарт:Демичев №921 22.03.2022

КонецПроцедуры
